{
    "moduleName": "IllegalMap",
    "latestVersion": "2.0.0",
    "dependencies": [
        "Vigilance",
        "RenderLib",
        "CTAutocomplete",
        "requestV2",
        "PogData"
    ],
    "author": "UnclaimedBloom6",
    "changelog": [
        "Shows the user every room in the Dungeon",
        "Can be used as a stand alone map",
        "Tons of customization options",
        "Reliable player icons",
        "    - Option to mark where a player died",
        "Major performance improvements over 1.X",
        "Show the username of each player under their map icon",
        "Legit Mode",
        "    - Hides unexplored rooms",
        "    - Functions like a regular dungeon map, with an accurate score calc",
        "    - Secrets, crypts and other info still available (Just not total/remaining secrets)",
        "    - Room names of explored rooms can be seen",
        "    - Player icons still 100% reliable",
        "Auto Scan automatically scans the dungeon upon warping",
        "Chat Info shows the user useful information about the dungeon after the dungeon has been fully scanned",
        "Update Checker",
        "Show the names of all rooms on the map",
        "    - Change the color of the room names on the map",
        "    - Show only important room names on the map (Puzzles, Trap)",
        "    - Peek keybind to show room names only when the keybind + LSHIFT is being held down",
        "    - Replace checkmarks with the number of secrets in the room, can change color depending on the checkmark eg green check = green text",
        "Darken unexplored rooms to make them easier to differentiate between already explored rooms",
        "Esp features",
        "    - Change the color of wither doors so that they can be seen more easily",
        "    - Star mob esp draws a box around starred mobs and minibosses to find mobs more easily",
        "    - Wither door esp draws a box around wither doors and the blood door",
        "Super accurate score calculator",
        "    - Option to say a customizable message in party chat when 300 score has been reached",
        "    - Option to say a customizable message in party chat when a mimic has been revealed",
        "    - Show which room the mimic is in",
        "    - Paul option to add 10 bonus score onto each run",
        "        - Option to toggle always on, always off or Auto Detect",
        "    - Spirit pet auto detection for the first player to die. (Use /spirits to see which players have a spirit pet)",
        "    - Score calculator can be set to 'seperate' and the main map can be disabled so only the score calculator is shown. Still works as normal.",
        "Discord rich presence",
        "    - Shows which room you are currently in as well as how many secrets have been found in it ",
        "    - Shows which floor you are currently playing"
    ]
}
